experiments/results/raw/baseline-disconnect-02-20260829T032918Z/k6.log
time="2026-08-29T03:29:20Z" level=warning msg="There were unknown fields in the options exported in the script" error="json: unknown field \"gracefulStop\""

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/hls.js
        output: json (/results/k6-metrics.jsonl)

     scenarios: (100.00%) 1 scenario, 5 max VUs, 48s max duration (incl. graceful stop):
              * default: Up to 5 looping VUs for 18s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 1/5 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 1/5 VUs  01.0s/18.0s

running (02.0s), 2/5 VUs, 9 complete and 0 interrupted iterations
default   [  11% ] 2/5 VUs  02.0s/18.0s

running (03.0s), 2/5 VUs, 18 complete and 0 interrupted iterations
default   [  17% ] 2/5 VUs  03.0s/18.0s

running (04.0s), 2/5 VUs, 28 complete and 0 interrupted iterations
default   [  22% ] 2/5 VUs  04.0s/18.0s

running (05.0s), 2/5 VUs, 38 complete and 0 interrupted iterations
default   [  28% ] 2/5 VUs  05.0s/18.0s

running (06.0s), 2/5 VUs, 47 complete and 0 interrupted iterations
default   [  33% ] 2/5 VUs  06.0s/18.0s

running (07.0s), 2/5 VUs, 57 complete and 0 interrupted iterations
default   [  39% ] 2/5 VUs  07.0s/18.0s

running (08.0s), 2/5 VUs, 67 complete and 0 interrupted iterations
default   [  44% ] 2/5 VUs  08.0s/18.0s

running (09.0s), 3/5 VUs, 77 complete and 0 interrupted iterations
default   [  50% ] 3/5 VUs  09.0s/18.0s

running (10.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  56% ] 5/5 VUs  10.0s/18.0s

running (11.0s), 5/5 VUs, 115 complete and 0 interrupted iterations
default   [  61% ] 5/5 VUs  11.0s/18.0s

running (12.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
default   [  67% ] 5/5 VUs  12.0s/18.0s

running (13.0s), 5/5 VUs, 162 complete and 0 interrupted iterations
default   [  72% ] 5/5 VUs  13.0s/18.0s

running (14.0s), 5/5 VUs, 186 complete and 0 interrupted iterations
default   [  78% ] 5/5 VUs  14.0s/18.0s

running (15.0s), 5/5 VUs, 207 complete and 0 interrupted iterations
default   [  83% ] 5/5 VUs  15.0s/18.0s

running (16.0s), 5/5 VUs, 231 complete and 0 interrupted iterations
default   [  89% ] 5/5 VUs  16.0s/18.0s

running (17.0s), 4/5 VUs, 256 complete and 0 interrupted iterations
default   [  94% ] 4/5 VUs  17.0s/18.0s

running (18.0s), 3/5 VUs, 274 complete and 0 interrupted iterations
default   [ 100% ] 3/5 VUs  18s


  █ THRESHOLDS 

    hls_playlist_failures
    ✓ 'count>=0' count=0

    hls_segment_failures
    ✓ 'count>=0' count=0

    hls_session_failures
    ✓ 'rate>=0' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 831     45.668467/s
    checks_succeeded...: 100.00% 831 out of 831
    checks_failed......: 0.00%   0 out of 831

    ✓ master playlist is 200
    ✓ media playlist is 200
    ✓ segment is 200

    CUSTOM
    hls_playlist_failures..........: 0      0/s
    hls_playlist_requests..........: 554    30.445644/s
    hls_segment_duration...........: avg=7.65ms   min=881.89µs med=1.59ms   max=503.24ms p(90)=4.37ms   p(95)=5.65ms   p(99)=127.71ms
    hls_segment_failures...........: 0      0/s
    hls_segment_requests...........: 277    15.222822/s
    hls_session_failures...........: 0.00%  0 out of 277
    selected_edge_node.............: 831    45.668467/s

    HTTP
    http_req_duration..............: avg=2.97ms   min=169.18µs med=781.37µs max=503.24ms p(90)=2.78ms   p(95)=4.13ms   p(99)=6.85ms  
      { expected_response:true }...: avg=2.97ms   min=169.18µs med=781.37µs max=503.24ms p(90)=2.78ms   p(95)=4.13ms   p(99)=6.85ms  
    http_req_failed................: 0.00%  0 out of 844
    http_reqs......................: 844    46.382895/s

    EXECUTION
    iteration_duration.............: avg=212.04ms min=202.7ms  med=205.04ms max=716.83ms p(90)=211.41ms p(95)=216.97ms p(99)=349.31ms
    iterations.....................: 277    15.222822/s
    vus............................: 3      min=1        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 319 MB 18 MB/s
    data_sent......................: 172 kB 9.5 kB/s



running (18.2s), 0/5 VUs, 277 complete and 0 interrupted iterations
default ✓ [ 100% ] 0/5 VUs  18s